print("                            _ooOoo_  ")
print("                           o8888888o  ")
print("                           88  .  88  ")
print("                           (| -_- |)  ")
print("                            O\\ = /O  ")
print("                        ____/`---'\\____  ")
print("                      .   ' \\| |// `.  ")
print("                       / \\||| : |||// \\  ")
print("                     / _||||| -:- |||||- \\  ")
print("                       | | \\\\\\ - /// | |  ")
print("                     | \\_| ''\\---/'' | |  ")
print("                      \\ .-\\__ `-` ___/-. /  ")
print("                   ___`. .' /--.--\\ `. . __  ")
print("                ."" '< `.___\\_<|>_/___.' >'"".  ")
print("               | | : `- \\`.;`\\ _ /`;.`/ - ` : | |  ")
print("                 \\ \\ `-. \\_ __\\ /__ _/ .-` / /  ")
print("         ======`-.____`-.___\\_____/___.-`____.-'======  ")
print("                            `=---='  ")
print("  ")
print("         ..................................................  ")
print("                  佛祖镇楼                  BUG辟易  ")
print("          佛曰:  ")
print("                  写字楼里写字间，写字间里程序员；  ")
print("                  程序人员写程序，又拿程序换酒钱。  ")
print("                  酒醒只在网上坐，酒醉还来网下眠；  ")
print("                  酒醉酒醒日复日，网上网下年复年。  ")
print("                  但愿老死电脑间，不愿鞠躬老板前；  ")
print("                  奔驰宝马贵者趣，公交自行程序员。  ")
print("                  别人笑我忒疯癫，我笑自己命太贱；  ")
print("                  不见满街漂亮妹，哪个归得程序员？"  )
print("春江潮水连海平，海上明月共潮生。
       滟滟随波千万里，何处春江无月明。
       江流宛转绕芳甸，月照花林皆似霰。
       空里流霜不觉飞，汀上白沙看不见。
       江天一色无纤尘，皎皎空中孤月轮。
       江畔何人初见月？江月何年初照人？
       人生代代无穷已，江月年年望相似。
       不知江月待何人，但见长江送流水。
       白云一片去悠悠，青枫浦上不胜愁。
       谁家今夜扁舟子，何处相思明月楼。
       可怜楼上月徘徊，应照离人妆镜台。
       玉户帘中卷不去，捣衣砧上拂还来。
       此时相望不相闻，愿逐月华流照君。
       鸿雁长飞光不度，鱼龙潜跃水成文。
       昨夜闲潭梦落花，可怜春半不还家。
       江水流春去欲尽，江潭落月复西斜。
       斜月沉沉藏海雾，碣石潇湘无限路。
       不知乘月几人归，落月摇情满江树。")
a = "寂寞梧桐深院锁清秋"
print("无言独坐西楼，月如钩，%s"% a)